/*
	File:		SlicesStrings.strings

	Contains:
	Copyright:	© 2007-2009 by Apple Inc., all rights reserved.
*/

//===========================================================================
// NOTE FOR LOCALIZERS:
// For any attributes overridden using the MDSlicesAttributeNameOverrides
// strings file, special care must be taken here. The KEY of the strings
// here will change from its english version to the name override.  For example:
//
// If MDSlicesAttributeNameOverrides.strings contains:
//		kMDItemTextContent = "TEXTCONTENT";
//
// Then replace any use of "Contents" (the english localization) in the KEYS
// of this file with the localization provided in MDSlicesAttributeNameOverrides.strings.
//
// In the above example, the localizer should change the text content localization below from:
//		"%[Contents]@ contains %@" = "%1$[Contents]@ contains %2$@";  // english version
//	to:
//		"%[TEXTCONTENT]@ contains %@" = "%1$[TEXTCONTENT]@ xxxxxx %2$@"; // localized version
//===========================================================================

/* Compound-type slices */
"%[Any]@ of the following are true" = "%1$[Certaines des]@ conditions suivantes sont vraies";
"%[All]@ of the following are true" = "%1$[Toutes les]@ conditions suivantes sont vraies";
"%[None]@ of the following are true" = "%1$[Aucune des]@ conditions suivantes n’est vraie";

/* Specific kind strings */
"%[Kind]@ is %[any]@" = "%1$[Type]@ est %2$[Quelconque]@";
"%[Kind]@ is %[applications]@" = "%1$[Type]@ est %2$[Application]@";
"%[Kind]@ is %[documents]@" = "%1$[Type]@ est %2$[Document]@";
"%[Kind]@ is %[folders]@" = "%1$[Type]@ est %2$[Dossier]@";
"%[Kind]@ is %[images]@ %[all]@" = "%1$[Type]@ est %2$[Image]@ %3$[Tous]@";
"%[Kind]@ is %[images]@ %[JPEG]@" = "%1$[Type]@ est %2$[Image]@ %3$[JPEG]@";
"%[Kind]@ is %[images]@ %[TIFF]@" = "%1$[Type]@ est %2$[Image]@ %3$[TIFF]@";
"%[Kind]@ is %[images]@ %[GIF]@" = "%1$[Type]@ est %2$[Image]@ %3$[GIF]@";
"%[Kind]@ is %[images]@ %[PNG]@" = "%1$[Type]@ est %2$[Image]@ %3$[PNG]@";
"%[Kind]@ is %[images]@ %[BMP]@" = "%1$[Type]@ est %2$[Image]@ %3$[BMP]@";
"%[Kind]@ is %[music]@ %[all]@" = "%1$[Type]@ est %2$[Musique]@ %3$[Tous]@";
"%[Kind]@ is %[music]@ %[MP3]@" = "%1$[Type]@ est %2$[Musique]@ %3$[MP3]@";
"%[Kind]@ is %[music]@ %[AAC]@" = "%1$[Type]@ est %2$[Musique]@ %3$[AAC]@";
"%[Kind]@ is %[music]@ %[purchased]@" = "%1$[Type]@ est %2$[Musique]@ %3$[Achetée]@";
"%[Kind]@ is %[PDF]@" = "%1$[Type]@ est %2$[PDF]@";
"%[Kind]@ is %[presentations]@" = "%1$[Type]@ est %2$[Présentation]@";
"%[Kind]@ is %[text]@ %[all]@" = "%1$[Type]@ est %2$[Texte]@ %3$[Tous]@";
"%[Kind]@ is %[text]@ %[plain text]@" = "%1$[Type]@ est %2$[Texte]@ %3$[format Texte]@";
"%[Kind]@ is %[text]@ %[rich text]@" = "%1$[Type]@ est %2$[Texte]@ %3$[RTF]@";
"%[Kind]@ is %[text]@ %[HTML]@" = "%1$[Type]@ est %2$[Texte]@ %3$[HTML]@";
"%[Kind]@ is %[text]@ %[XML]@" = "%1$[Type]@ est %2$[Texte]@ %3$[XML]@";
"%[Kind]@ is %[text]@ %[source code]@" = "%1$[Type]@ est %2$[Texte]@ %3$[Code source]@";
"%[Kind]@ is %[movies]@" = "%1$[Type]@ est %2$[Vidéo]@";
"%[Kind]@ is %[other]@ %@" = "%1$[Type]@ est %2$[Autre]@ %3$@";

/* date-type attribute template, like kMDItemContentCreationDate */
"%@ is %[within last]@ %@ %[days]@" = "%1$@ est %2$[dans les]@ %3$@ %4$[derniers jours]@";
"%@ is %[within last]@ %@ %[weeks]@" = "%1$@ est %2$[dans les]@ %3$@ %4$[dernières semaines]@";
"%@ is %[within last]@ %@ %[months]@" = "%1$@ est %2$[dans les ]@ %3$@ %4$[derniers mois]@";
"%@ is %[within last]@ %@ %[years]@" = "%1$@ est %2$[dans les]@ %3$@ %4$[dernières années]@";
"%@ is %[exactly]@ %@" = "%1$@ est %2$[exactement]@ %3$@";
"%@ is %[before]@ %@" = "%1$@ est %2$[avant]@ %3$@";
"%@ is %[after]@ %@" = "%1$@ est %2$[après]@ %3$@";
"%@ is %[today]@" = "%1$@ est %2$[aujourd’hui]@";
"%@ is %[yesterday]@" = "%1$@ est %2$[hier]@";
"%@ is %[this week]@" = "%1$@ est %2$[cette semaine]@";
"%@ is %[this month]@" = "%1$@ est %2$[ce mois-ci]@";
"%@ is %[this year]@" = "%1$@ est %2$[cette année]@";

/* string-type attribute, like kMDItemDisplayName */
"%@ %[contains]@ %@" = "%1$@ %2$[contient]@ %3$@";
"%@ %[begins with]@ %@" = "%1$@ %2$[commence par]@ %3$@";
"%@ %[ends with]@ %@" = "%1$@ %2$[se termine par]@ %3$@";
"%@ %[is]@ %@" = "%1$@ %2$[est]@ %3$@";
"%@ %[matches]@ %@" = "%1$@ %2$[correspond à]@ %3$@";

/* boolean-type attribute, like kMDItemFlashOnOff */
"%@ %[any]@" = "%1$@ %2$[quelconque]@";
"%@ %[yes]@" = "%1$@ %2$[Oui]@";
"%@ %[no]@" = "%1$@ %2$[Non]@";

/* file visibility */
"%[File invisible]@ %[visible items]@" = "%1$[Visibilité du fichier]@ %2$[éléments visibles]@";
"%[File invisible]@ %[invisible items]@" = "%1$[Visibilité du fichier]@ %2$[éléments invisibles]@";
"%[File invisible]@ %[visible or invisible]@" = "%1$[Visibilité du fichier]@ %2$[éléments visibles ou invisibles]@";

/* raw query slice */
"%[Raw query]@ %@" = "%1$[Requête brute]@ %2$@";

/* file extension slice */
"%[File Extension]@ %[is]@ %@" = "%1$[Extension de fichier]@ %2$[est]@ %3$@";

/* number-type attribute, like kMDItemAudioChannelCount */
"%@ %[equals]@ %@" = "%1$@ %2$[est égale à]@ %3$@";
"%@ %[is greater than]@ %@" = "%1$@ %2$[est supérieure à]@ %3$@";
"%@ %[is less than]@ %@" = "%1$@ %2$[est inférieure à]@ %3$@";
"%@ %[is not]@ %@" = "%1$@ %2$[est différente de]@ %3$@";

/* text contents */
"%@ contains %@" = "%1$@ contient %2$@";

/* Byte-sized attributes, such as kMDItemFSSize */
"%@ %[equals]@ %@ %[KB]@" = "%1$@ %2$[est égale à]@ %3$@ %4$[ Ko]@";
"%@ %[equals]@ %@ %[MB]@" = "%1$@ %2$[est égale à]@ %3$@ %4$[ Mo]@";
"%@ %[equals]@ %@ %[GB]@" = "%1$@ %2$[est égale à]@ %3$@ %4$[ Go]@";
"%@ %[is less than]@ %@ %[KB]@" = "%1$@ %2$[est inférieure à]@ %3$@ %4$[ Ko]@";
"%@ %[is less than]@ %@ %[MB]@" = "%1$@ %2$[est inférieure à]@ %3$@ %4$[ Mo]@";
"%@ %[is less than]@ %@ %[GB]@" = "%1$@ %2$[est inférieure à]@ %3$@ %4$[ Go]@";
"%@ %[is greater than]@ %@ %[KB]@" = "%1$@ %2$[est supérieure à]@ %3$@ %4$[ Ko]@";
"%@ %[is greater than]@ %@ %[MB]@" = "%1$@ %2$[est supérieure à]@ %3$@ %4$[ Mo]@";
"%@ %[is greater than]@ %@ %[GB]@" = "%1$@ %2$[est supérieure à]@ %3$@ %4$[ Go]@";
"%@ %[is not]@ %@ %[KB]@" = "%1$@ %2$[est différente de]@ %3$@ %4$[ Ko]@";
"%@ %[is not]@ %@ %[MB]@" = "%1$@ %2$[est différente de]@ %3$@ %4$[ Mo]@";
"%@ %[is not]@ %@ %[GB]@" = "%1$@ %2$[est différente de]@ %3$@ %4$[ Go]@";

/* Duration-type attributes, such as kMDItemDurationSeconds */
"%@ %[equals]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[est égale à]@ %3$@ heures %4$@ minutes %5$@ secondes";
"%@ %[is less than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[est inférieure à]@ %3$@ heures %4$@ minutes %5$@ secondes";
"%@ %[is greater than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[est supérieure à]@ %3$@ heures %4$@ minutes %5$@ secondes";
"%@ %[is not]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[est différente de]@ %3$@ heures %4$@ minutes %5$@ secondes";

/* This is for the slice that is added when a search string is present in the search field when saving a search. */
"%[Items matching text]@ %@" = "%1$[éléments correspondant aux texte]@ %2$@";

/* Search System Files slice */
"%[SEARCH_SYSTEM_FILES]@ %[YES]@" = "%1$[Fichiers système]@ %2$[sont inclus]@";
"%[SEARCH_SYSTEM_FILES]@ %[NO]@" = "%1$[Fichiers système]@ %2$[ne sont pas inclus]@";

/* Spotlight items slice */
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[YES]@" = "%1$[éléments Spotlight]@ %2$[sont inclus]@";
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[NO]@" = "%1$[éléments Spotlight]@ %2$[ne sont pas inclus]@";

